[
    {
        "item name": "Whirlpool W10276348 Glass Shelf",
        "item description": "This is an O.E.M authorized part Fits various whirlpool models O.E.M part number w10276348 This is a Whirlpool replacement part Part Number W10276348 This is an O.E.M. part",
        "reviews": [
            {
                "stars": 3.0,
                "content": "Title: Does not hold meat drawer, Text: This does not have the slide hooks for the drawer below it. So other than that it's fine."
            },
            {
                "stars": 5.0,
                "content": "Title: Five Stars, Text: it was a nice fit."
            }
        ]
    },
    {
        "item name": "2-Pack K45WW Wire Whip Replacement for Whirlpool & Kitchenaid Mixers - Compatible with Part Number AP6013701, 4162165, 4169927, 4176070, 9706446, PS11746928",
        "item description": "UpStart Components Replacement K45WW Wire Whip. Quantity: 2 Ultra durable, high quality material resists wear and tear over time. Easy at-home installation. An affordable way to extend the life of your machine. Compatible WP9704329 Wire Whip for Tilt-Head Stand Mixer for Part Number WPW10672617, AP6023717, W10672617, 9708470, 9708472, 4162163, 4169986, 9707669, PS11757063, W10687981, WP9704329, AP6013701, 9704329, 4162165, 4169927, 4176070, 9706446",
        "reviews": [
            {
                "stars": 1.0,
                "content": "Title: Look closely that your mixer, Text: It didn’t fit and it took forever to get a refund!"
            }
        ]
    },
    {
        "item name": "JY Hong Cheng Refrigerator Base Multi-functional Front Load Top Freezer Washing Machine Base Stand",
        "item description": "Using the base easily to move the floor standing home appliance,like washing machine,refrigerator and ice maker. The base size can be adjustable.Width: 17.71-27.55 inches,Depth: 18.50-27.55 inches, Height:3.93-5.12 inches Weight Capacity of the base is 250KG/550 lbs.It is enough weight capacity for many type of home appliance. 8 fixed legs can protect the machine better with good weight capacity. Raw material is PP(Polypropylene),square stainless steel tube",
        "reviews": [
            {
                "stars": 1.0,
                "content": "Title: DO NOT WORK!, Text: I have a standard, regular size washer and drying just bought from SEARS, not too old or obsolete in any way. These bases did NOT stretch or open up enough to be able to fit my regular STANDARD size washer and drying. I am unsure if they fit any at all, it would have to be a mini washer and drying because they dont fit regular normal ones. Very disappointed."
            }
        ]
    },
    {
        "item name": "Compatible Lint Screen Filter for Maytag MGDE300VW1, WED9450WR1, Maytag MGD9800TQ0, Kenmore / Sears 11065942401 Dryer",
        "item description": "New Compatible with Part Number W10120998 Lint Screen Filter SAVE MONEY! Don't spend hundreds of dollars replacing your dryer when all you need is a replacement dryer lint screen filter. EASY TO INSTALL! If you are a DIY person or have experience fixing your dryer, it is pretty easy to replace your old dryer lint screen filter. If not, your local appliance repair shop can do it for you! FITS PERPECTLY! This aftermarket lint screen filter is manufactured to fit the listed models. Please make sure to check your original part to confirm that you are buying the correct product.",
        "reviews": [
            {
                "stars": 1.0,
                "content": "Title: Not all descriptions are factual., Text: Although this filter claimed to be a match, it did not fit. The design was just different enough to prevent it from sliding into the filter slot."
            }
        ]
    },
    {
        "item name": "GE WB24X10130 Range Hood Light Switch",
        "item description": "The GE WB24X10130 is a genuine OEM Light Switch for Range Hoods This GE Light Switch lets you turn the light on and off The GE WB24X10130 can be applied to some Range Hoods of the following brands: GE The WB24X10130 is an original GE Light Switch that is manufactured to exact specifications with high quality materials Have confidence when making repairs or servicing your appliances with genuine GE parts",
        "reviews": [
            {
                "stars": 5.0,
                "content": "Title: Good product and fast shipping, Text: Screwed on and worked without any problem. Good product and fast shipping."
            },
            {
                "stars": 5.0,
                "content": "Title: Five Stars, Text: Exact replacement worked great."
            }
        ]
    }
]