[
    {
        "item name": "BALEAF Women's Long Sleeve Zip Beach Coverup UPF 50+ Sun Protection Hooded Cover Up Shirt Dress with Pockets",
        "item description": "90% Polyester, 10% Spandex Zipper closure Machine Wash Long sleeve sun protection coverups--UPF 50+ blocks the sun from burning Zipped v-neckline--fashionable V neck and smooth 1/4 zipper allows to staying place as you like Two drop-in side pockets--hold your phone or keys well，no worries of falling out Hoodie with non-slip drawcord--Enhancing hooded design is convenient to wrap your face and enough space to put your head and hair easily A flattering coverups company you spend all day on the beach，traveling with lovers or busying around house. Recommended For everyday leisure or daily exercise",
        "reviews": []
    },
    {
        "item name": "Merrell Work Moab 2 Vent Waterproof SR Boulder",
        "item description": "Rubber sole",
        "reviews": []
    },
    {
        "item name": "SAS Women's, Relaxed Sandal",
        "item description": "Made in the USA Suede sole Heel measures approximately 1.5 inches\" COMFY FOOTWEAR: Unwind, leave your worries behind, and simply relax and enjoy the comfort of the versatile SAS Relaxed sandal with pemium leather uppers in a casual sandal silhouette CUSHION LININGS: It features Ultra-Puff cushioned linings that protect the foot with Super Soft topline construction eliminating harsh edges against the foot SHOCK ABSORPTION: A broad, contoured footbed features soft Super Suede linings that molds to the natural arches and curves of your foot for maximum comfort and shock absorption QUALITY BUILD: It offers multi-layered Tripad cushions designed to comfort all three pressure points: the inside ball, outside ball and heel for all-day support ADJUSTABLE CLOSURE: SAS sandal features three-point adjustability with durable buckles at each strap while a shock-absorbing wide outsole contours and rebounds with every step",
        "reviews": []
    },
    {
        "item name": "SheIn Women's Basic Stretch Plaid Mini Bodycon A-Line Pencil Skirt",
        "item description": "Zipper closure Fabric has some stretch; Please refer to the size information below Casual, Plaid, Slim Fit, Mini Mid-rise waist, Above Knee, Short Length Suitable for All Season, Workwear, Office, Formal Soft and High Quality Fabric",
        "reviews": []
    },
    {
        "item name": "Michael Kors Cindy, Women’s Cross-Body Bag",
        "item description": "Leather 9-1/2\" W x 5-1/4\" H x 2-1/4\" D Interior features 1 slip pocket and 1 zip pocket Exterior features gold- or silver-tone hardware and signature lettering Adjustable crossbody strap with 24\"-26\" drop Top zip closure",
        "reviews": []
    },
    {
        "item name": "Jewelili Sterling Silver Princess-cut Diamond Bridal set, 1/3Cttw",
        "item description": "Sterling Silver 1/3 Cttw Natural White Princess and Round Diamond Bridal Ring, Size 7 Packaging & Return – All our Jewelry pieces come with a beautiful jewelry box. 30 days no question asked return policy. Jewelili Promise - All our Diamonds and Gemstones are conflict free and are finely crafted in high-quality materials. With an unparalleled dedication to quality and customer satisfaction we offer fine jewelry at affordable prices. Gifting: A perfect self-gift. Also a great gift for your wife, girlfriend or romantic partner for various occasions like Birthday, Graduation day, Anniversary, Valentine’s day or Mother’s day.",
        "reviews": []
    },
    {
        "item name": "Dr. Scholl's Shoes Women's Dawn It Loafer",
        "item description": "Textile Imported Man Made sole Shaft measures approximately not_applicable from arch Heel measures approximately 1 inches\" Be Energized insole with all-day comfort, cushioning and shock absorption that reduces foot pressure & fatigue. Knit upper. Twin gore panels for extra flexibility. Flexible, durable sole.",
        "reviews": []
    },
    {
        "item name": "Costume Gloves Kids Girls Boys Princess Dress Up Gloves Short Spandex Formal Gloves For Child Tea Party,Birthday",
        "item description": "Polyester,Spandex Pull On closure Do Not Bleach,Do Not Iron,Hand Wash,Line Dry,Mild Detergent <ul><li> Soft material:made of polyester and spandex,child gloves stretchy and breathable,durable and sturdy,full finger design can be used for a long time <br></li></ul> <ul><li>Fit for 5-12 years old kids:the length of the glove is 7.5 inch and width is 3 inch,costume gloves are suitable 5-12 years old and high elasticity   </li></ul> <ul><li> Universal gloves:suitable Halloween costume,Wedding,Banquet,Magic show, Pageant,Birthday,Tea Party,Princess Dress Up, School activities and so on </li></ul> <ul><li> Lovely gift:Your boy and girl thank you very much for giving her purpose gloves,they can use the gloves to all cosplay</li></ul> <ul><li> Professional service:If you have any questions, please contact us, don’t have any concerns, we will definitely help you solve them  </li></ul>",
        "reviews": []
    },
    {
        "item name": "Chowsir Women Fashion V-Neck Formal Lace Evening Party Prom Midi Dress",
        "item description": "Lace Zipper closure Made of Lace, soft and comfortable fabric. S=US 2, M=US 6, L=US 10, XL=US 14, XXL=US 18. Please read our Size Table image instead of the size chart. Vintage, elgant, slim fit. Belt decoration, zipper on back. Suit for wedding, party, cocktail, prom, gala, evening, dating.",
        "reviews": []
    },
    {
        "item name": "Travelon Healthy Travel Blanket, Red, One Size",
        "item description": "Healthy Travel Blanket Polyester Fleece Travel healthy rest easy Soft comfortable fleece Packs into its own pocket",
        "reviews": []
    }
]